# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.doclayout_yolo.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.67, 1.0, 2048] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, YoloSwinStem, [96, [4,4]]] # 0-P1/4
  - [-1, 1, YoloSwinBlock, [96, 0, 2, [0,1], 12, [3,6,12,24], 0.2, [7,7], 4.0, 0.0, 0.0, True]] # 1-P2/8
  - [-1, 1, YoloSwinBlock, [96, 1, 2, [2,3], 12, [3,6,12,24], 0.2, [7,7], 4.0, 0.0, 0.0, True]] # 2-P3/16
  - [-1, 1, YoloSwinBlock, [96, 2, 6, [4,5,6,7,8,9], 12, [3,6,12,24], 0.2, [7,7], 4.0, 0.0, 0.0, True]] # 3-P4/32
  - [-1, 1, YoloSwinBlock, [96, 3, 2, [10,11], 12, [3,6,12,24], 0.2, [7,7], 4.0, 0.0, 0.0, False]] # 4-P5/32
  # - [-1, 1, YoloSwinReshape, []] # 5
  - [-1, 1, Conv, [768, 1, 1]] # 6
  - [-1, 1, PSA, [768]] # 7

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 8
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [384]] # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [192]] # 13 (P3/8-small)

  - [-1, 1, Conv, [192, 3, 2]] # 14
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [384, True]] # 16 (P4/16-medium)

  - [-1, 1, SCDown, [384, 3, 2]] # 17
  - [[-1, 6], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [768, True]] # 19 (P5/32-large)

  - [[12, 15, 18], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
