# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.doclayout_yolo.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.67, 1.0, 2048] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4
  - [-1, 1, SKBlock, [64, 128, 256, 3, 1]] # 2-P2/4
  - [-1, 1, SKBlock, [256, 256, 512, 4, 2]] # 3-P3/8
  - [-1, 1, SKBlock, [512, 512, 1024, 6, 2]] # 4-P4/16
  - [-1, 1, SKBlock, [1024, 1024, 2048, 3, 2]] # 5-P5/32
  - [-1, 1, Conv, [768, 1, 1]] # 6
  - [-1, 1, PSA, [768]] # 7

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 7
  - [[-1, 4], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [384]] # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [192]] # 12 (P3/8-small)

  - [-1, 1, Conv, [192, 3, 2]] # 13
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [384, True]] # 15 (P4/16-medium)

  - [-1, 1, SCDown, [384, 3, 2]] # 16
  - [[-1, 7], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [768, True]] # 18 (P5/32-large)

  - [[12, 15, 18], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
